
;   ▄██████▄  ████████▄     ▄████████  ▄████████    ▄█    █▄     ▄█  
;  ███    ███ ███   ▀███   ███    ███ ███    ███   ███    ███   ███  
;  ███    ███ ███    ███   ███    ███ ███    █▀    ███    ███   ███▌ 
;  ███    ███ ███    ███   ███    ███ ███         ▄███▄▄▄▄███▄▄ ███▌ 
;  ███    ███ ███    ███ ▀███████████ ███        ▀▀███▀▀▀▀███▀  ███▌ 
;  ███    ███ ███    ███   ███    ███ ███    █▄    ███    ███   ███  
;  ███    ███ ███   ▄███   ███    ███ ███    ███   ███    ███   ███  
;   ▀██████▀  ████████▀    ███    █▀  ████████▀    ███    █▀    █▀   
;                                                                    
                                                                  

[MD_WOTC_OW_ODACHI_CLASSIC_T2 X2WeaponTemplate]
FriendlyName="Dragonblade"
AbilityDescName="dragonblade"
BriefSummary= "These blades were developed by the paramilitary group known as 'Overwatch.' Who they are, what their objectives, and capabilities are as of yet unknown. The blades in question make use of a system of nanoscale electronic oscillators to apply ultrasonic vibration to the blade. Metallurgical makeup of the blade varies and its theorized that several were made as experiments. Flaws in the placement and power of the oscillators could lead to the blade shattering, as could flaws in the material. Thankfully X-com has ready access to a variety of materials that can handle the strain. The oscillators combined with a small computing device that adapts the amount of sonic force applied to the blade and placement of that force essentially creates a device our soldiers have nicknamed a 'Hypercutter.' Apparently these blades were wielded by some form of cyborg augment and it is suggested we engage in similar research avenues."
TacticalText="<Bullet/>Type: Ōdachi.\n<Bullet/>Origin: Japan\n<Bullet/>Tier: Magnetic"

[MD_WOTC_OW_ODACHI_CLASSIC_T3 X2WeaponTemplate]
FriendlyName="Dragon Line Blade"
AbilityDescName="dragon line blade"
BriefSummary= "These blades were developed by the paramilitary group known as 'Overwatch.' Who they are, what their objectives, and capabilities are as of yet unknown. The blades in question make use of a system of nanoscale electronic oscillators to apply ultrasonic vibration to the blade. Metallurgical makeup of the blade varies and its theorized that several were made as experiments. Flaws in the placement and power of the oscillators could lead to the blade shattering, as could flaws in the material.\nThe original hypercutter blades were made of a steel alloy due to both its ready availability and its durability when placed under sonic stress. We have since developed a lighter titanium based blade that is as strong as steel at half the weight. On top of that advances in nanoscale electronics have allowed us to produce a more effective sonic edge. That, along with modular construction, makes the 'Dragon Line Blade' an ideal tool for our CQC specialists."
TacticalText="<Bullet/>Type: Ōdachi.\n<Bullet/>Origin: Japan\n<Bullet/>Tier: Beam"

[MD_WOTC_OW_ODACHI_CLASSIC_T4 X2WeaponTemplate]
FriendlyName="Master-Crafted Dragonblade"
AbilityDescName="advanced dragonblade"
BriefSummary= "These blades were developed by the paramilitary group known as 'Overwatch.' Who they are, what their objectives, and capabilities are as of yet unknown. The blades in question make use of a system of nanoscale electronic oscillators to apply ultrasonic vibration to the blade. Metallurgical makeup of the blade varies and it's theorized that several were made as experiments. Flaws in the placement and intensity of the oscillators could lead to the blade shattering, as could flaws in the material.\nAdvancements in nanoscale electronics and adaptive artificial intelligence along with access to materials that would've been declare science fiction before the invasion have produced the penultimate Dragon Line Blade. Each model comes with a modular blade, an adaptive AI, and a series of bleeding edge nanotronic oscillators capable of not just taking out an opponent but learning from them."
TacticalText="<Bullet/>Type: Ōdachi.\n<Bullet/>Origin: Japan\n<Bullet/>Tier: Beam"
